Revit 2026 API

# UIControlledApplication Methods

---

The UIControlledApplication type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CreateAddInCommandBinding |  |
|  | CreateRibbonPanel(String) |  |
|  | CreateRibbonPanel(String, String) |  |
|  | CreateRibbonPanel(Tab, String) |  |
|  | CreateRibbonTab |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetDockablePane |  |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetRibbonPanels |  |
|  | GetRibbonPanels(String) |  |
|  | GetRibbonPanels(Tab) |  |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | LoadAddIn |  |
|  | LoadPackageContents |  |
|  | RegisterContextMenu |  |
|  | RegisterDockablePane |  |
|  | RemoveAddInCommandBinding |  |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

UIControlledApplication Class

Autodesk.Revit.UI Namespace